ams/src/Documents/_ПриемИзПереработки/_ПриемИзПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ПриемИзПереработки</name>
  <registerRecords>AccumulationRegister._ТоварыПереданные</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеТоваров</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.ВариантыКомплектацииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СборкаТоваров</name>
      <type>
        <types>DocumentRef.СборкаТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/AccumulationRegisters/_ТоварыПереданные/_ТоварыПереданные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>_ТоварыПереданные</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef._ВозвратИзПереработки</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ams/src/Enums/AMS_ОперацияСборкаТоваров/AMS_ОперацияСборкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_ОперацияСборкаТоваров</name>
  <enumValues>
    <name>ПереработкаБрака</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоФлаконов</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукции</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоФабриката</name>
  </enumValues>
  <enumValues>
    <name>РазборкаКоробок</name>
  </enumValues>
  <enumValues>
    <name>СборкаНаборов</name>
  </enumValues>
</mdclass:Enum>

ams/src/Enums/AMS_ОперацииПроизводства/AMS_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_ОперацииПроизводства</name>
  <enumValues>
    <name>ПеремещениеМатериаловВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоФабрикатов</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукции</name>
  </enumValues>
  <enumValues>
    <name>СписаниеМатериаловСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>СписаниеФабрикатаСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеБракаВЦех</name>
    <comment>Перемещение брака в цех (из склада бракованной продукции)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеБракаВЦехе</name>
  </enumValues>
  <enumValues>
    <name>СписаниеБракаВЦехеОрдер</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеМатериаловИзБрака</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеМатериаловИзБракаОрдер</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМатериаловВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМатериаловНаПереработкуБрака</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМатериаловБракаВОтходы</name>
  </enumValues>
  <enumValues>
    <name>СписаниеМатериаловНаПереработкуБрака</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеПроизведеннойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеПослеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукцииИзБрака</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоФлаконов</name>
  </enumValues>
  <enumValues>
    <name>ПриемИзПереработки</name>
    <comment>Прием из переработки (давальческого сырья)</comment>
  </enumValues>
</mdclass:Enum>

ams/src/Catalogs/НаправленияДеятельности/НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаправленияДеятельности</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыНаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетДоходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетЗатрат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетДенежныхСредствРаздельно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетДенежныхСредствПоКорреспонденции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВнеоборотныхАктивов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДСОпределяетсяВДокументе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНаправленияДеятельности</name>
    <type>
      <types>EnumRef.ТипыНаправленийДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемФинансированияКонтракта</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаМатериалы</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаОплатуТруда</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеПроизводственныеЗатраты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщепроизводственныеЗатраты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщехозяйственныеЗатраты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческиеРасходы</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибыльКонтракта</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УправленческиеРасходы</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКредитования</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентыПоКредитам</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйКонтракт</name>
    <type>
      <types>CatalogRef.ГосударственныеКонтракты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключенияКонтракта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтдельногоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозмещаемыхРасходов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетРасчетовСПоставщиками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделЛицевогоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДеятельности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДеятельности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопускаетсяОбособлениеСверхПотребности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлениеПризнакаДопускаетсяОбособлениеСверхПотребностиНеТребуется</name>
    <comment>Используется для обновления информационной базы</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Documents/_ПриемИзПереработки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	
	КлючевыеРеквизитыТабличнойЧасти = Новый Массив;
	КлючевыеРеквизитыТабличнойЧасти.Добавить("Номенклатура");
	КлючевыеРеквизитыТабличнойЧасти.Добавить("Спецификация");
	ОбщегоНазначенияУТ.ПроверитьНаличиеДублейСтрокТЧ(
		ЭтотОбъект,
		"Товары",
		КлючевыеРеквизитыТабличнойЧасти,
		Отказ,,
		Истина);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();

	Попытка

		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	т.СборкаТоваров КАК СборкаТоваров,
			|	т.Номенклатура КАК Флакон,
			|	т.Спецификация КАК Спецификация,
			|	т.Количество КАК Количество
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	&Товары КАК т
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт.СборкаТоваров КАК СборкаТоваров,
			|	вт.Флакон КАК Флакон,
			|	вт.Спецификация КАК Спецификация,
			|	Спец.Номенклатура КАК Преформа,
			|	вт.Количество * Спец.Количество КАК Количество
			|ИЗ
			|	вт КАК вт
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Спец
			|		ПО вт.Спецификация = Спец.Ссылка";

			Запрос.УстановитьПараметр("Товары", Товары.Выгрузить());

			Табл = Запрос.Выполнить().Выгрузить();

			Для Каждого Стр Из Товары Цикл
				СтрТабл = Табл.Найти(Стр.Номенклатура, "Флакон");

				Если Не СтрТабл = Неопределено Тогда
					Стр.СборкаТоваров = ПолучитьДокументСборкаТоваров(СтрТабл, Отказ);
				КонецЕсли;
			КонецЦикла;

			ОформитьДокументПеремещениеТоваров(Отказ);

		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			ОтменитьПроведение(Отказ);
		КонецЕсли;

		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(ИнформацияОбОшибке());
		Возврат;
	КонецПопытки;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПеремещениеТоваров = Документы.ПеремещениеТоваров.ПустаяСсылка();
	Для Каждого Стр Из Товары Цикл
		Стр.СборкаТоваров = Документы.СборкаТоваров.ПустаяСсылка();
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЗаполнитьРеквизитыПоУмолчанию();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Партнер КАК Партнер,
	|	&Контрагент КАК Контрагент,
	|	т.Номенклатура КАК Номенклатура,
	|	тов.Количество * т.Количество / д.Количество КАК Количество
	|ИЗ
	|	Документ._ПриемИзПереработки.Товары КАК тов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК д
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК т
	|			ПО (т.Ссылка = д.Ссылка)
	|		ПО тов.Спецификация = д.Ссылка
	|ГДЕ
	|	тов.Ссылка = &Ссылка";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Движения._ТоварыПереданные.Записывать = Истина;
	Движения._ТоварыПереданные.Загрузить(Рез.Выгрузить());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДокументСборкаТоваров(Выб, Отказ)
	СборкаТоваров = Выб.СборкаТоваров;

	Если ЗначениеЗаполнено(СборкаТоваров) Тогда
		Док = СборкаТоваров.ПолучитьОбъект();
	Иначе
		Док = Документы.СборкаТоваров.СоздатьДокумент();
	КонецЕсли;

	Если Док.ПометкаУдаления <> ПометкаУдаления Тогда
		мср.УстановитьПометкуУдаленияДокументу(Док, ПометкаУдаления, Отказ);
	КонецЕсли;

	Док.Дата = Дата;

	Док.Количество            = Выб.Количество;
	Док.КоличествоУпаковок    = Выб.Количество;
	Док.Комментарий           = "Сформирован автоматичестки. Оформление переработки товаров (на складе компании). Приём из переработки № "
		+ Номер + " от " + Формат(Дата, "ДЛФ=Д") + " г.";
	Док.Номенклатура          = Выб.Флакон;
	Док.Организация           = Организация;
	Док.Ответственный         = Ответственный;
	Док.Склад                 = AMS_ВызовСервера.СкладКомпании();
	Док.ВариантКомплектации   = Выб.Спецификация;
	Док.Подразделение         = Подразделение;
	Док.Статус                = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
	Док.СборкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
	Док.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	Док.AMS_Операция             = Перечисления.AMS_ОперацияСборкаТоваров.ПроизводствоФлаконов;

	Табл = Док.Товары;
	Табл.Очистить();
	НовСтр = Табл.Добавить();

	НовСтр.Номенклатура       = Выб.Преформа;
	НовСтр.Количество         = Выб.Количество;
	НовСтр.КоличествоУпаковок = Выб.Количество;

	мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ);

	Возврат Док.Ссылка;
КонецФункции

Процедура ОформитьДокументПеремещениеТоваров(Отказ)
	Если ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
		Док = ПеремещениеТоваров.ПолучитьОбъект();
	Иначе
		Док = Документы.ПеремещениеТоваров.СоздатьДокумент();
	КонецЕсли;

	Если Док.ПометкаУдаления <> ПометкаУдаления Тогда
		мср.УстановитьПометкуУдаленияДокументу(Док, ПометкаУдаления, Отказ);
	КонецЕсли;

	Док.Дата = Дата + 10;

	Док.ВидЦены                 = Справочники.Склады.УчетныйВидЦены(Склад);
	Док.Организация             = Организация;
	Док.Ответственный           = Ответственный;
	Док.Автор                   = Ответственный;
	Док.Подразделение           = Подразделение;
	Док.СкладОтправитель        = AMS_ВызовСервера.СкладКомпании();
	Док.СкладПолучатель         = Склад;
	Док.Статус                  = Перечисления.СтатусыПеремещенийТоваров.Принято;
	Док.НаправлениеДеятельности = Справочники.НаправленияДеятельности.НайтиПоНаименованию("Продажа", Истина);
	Док.ХозяйственнаяОперация   = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	Док.СпособДоставки          = Перечисления.СпособыДоставки.Самовывоз;
	Док.ВариантПриемкиТоваров   = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	Док.Комментарий             = "Сформирован автоматичестки. Оформление приёма из переработку (со склад компании). Приём из переработки № "
		+ Номер + " от " + Формат(Дата, "ДЛФ=Д") + " г.";

	Док._ОперацияПроизводства = Перечисления.AMS_ОперацииПроизводства.ПриемИзПереработки;

	Табл = Док.Товары;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить( , "Номенклатура,Количество"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	СУММА(вт.Количество) КАК Количество,
	|	СУММА(вт.Количество) КАК КоличествоУпаковок
	|ИЗ
	|	вт КАК вт
	|
	|СГРУППИРОВАТЬ ПО
	|	вт.Номенклатура";

	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();

	Табл.Очистить();

	Пока Выб.Следующий() Цикл
		Стр = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Выб);
	КонецЦикла;

	мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ);

	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Не удалось записать документ перемещения давальческой продукции на склад.");
	Иначе
		ПеремещениеТоваров = Док.Ссылка;
	КонецЕсли;
КонецПроцедуры
Процедура ЗаполнитьРеквизитыПоУмолчанию()
	Склад         = AMS_ВызовСервера.ПолучитьСвойСклад();
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры
Процедура ОтменитьПроведение(Отказ)
	Если ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
		Если ПометкаУдаления Тогда
			мср.УстановитьПометкуУдаленияДокументу(ПеремещениеТоваров, Истина, Отказ);

		ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПеремещениеТоваров, "Проведен") Тогда
			мср.ЗаписатьДокумент(ПеремещениеТоваров, РежимЗаписиДокумента.ОтменаПроведения, Отказ);
		КонецЕсли;
	КонецЕсли;

	Для Каждого Стр Из Товары Цикл
		СборкаТоваров = Стр.СборкаТоваров;
		Если ЗначениеЗаполнено(СборкаТоваров) Тогда
			Если ПометкаУдаления Тогда
				мср.УстановитьПометкуУдаленияДокументу(СборкаТоваров, Истина, Отказ);

			ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СборкаТоваров, "Проведен") Тогда
				мср.ЗаписатьДокумент(СборкаТоваров, РежимЗаписиДокумента.ОтменаПроведения, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = Организация;

	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = Склад;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
